# frozen_string_literal: true

# Taps
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'kreuzwerker/taps'
tap 'kubecolor/tap'
tap 'oven-sh/bun'
tap 'qmk/qmk'

# Formulas
brew 'ansible' # Automate deployment, configuration, and upgrading
brew 'argocd' # GitOps Continuous Delivery for Kubernetes
brew 'asdf' # Extendable version manager with support for Ruby, Node.js, Erlang & more
brew 'aws-iam-authenticator' # Use AWS IAM credentials to authenticate to Kubernetes
brew 'aws-nuke' # Nuke a whole AWS account and delete all its resources
brew 'awscli' # Official Amazon AWS command-line interface
brew 'azure-cli' # Microsoft Azure CLI 2.0
brew 'bash' # Bourne-Again SHell, a UNIX command interpreter
brew 'bat' # Clone of cat(1) with syntax highlighting and Git integration
brew 'cfssl' # CloudFlare's PKI toolkit
brew 'checkov' # Prevent cloud misconfigurations during build-time for IaC tools
brew 'colima' # Container runtimes on MacOS (and Linux) with minimal setup
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'diff-so-fancy' # Good-lookin' diffs with diff-highlight and more
brew 'direnv' # Load/unload environment variables based on $PWD
brew 'docker-compose' # Isolated development environments using Docker
brew 'docker-credential-helper' # Platform keystore credential helper for Docker
brew 'docker' # Pack, ship and run any application as a lightweight container
brew 'driftctl' # Detect, track and alert on infrastructure drift
brew 'eksctl' # Simple command-line tool for creating clusters on Amazon EKS
brew 'etcd' # Key value store for shared configuration and service discovery
brew 'exercism' # Command-line tool to interact with exercism.io
brew 'eza' # Modern, maintained replacement for ls
brew 'fd' # Simple, fast and user-friendly alternative to find
brew 'figlet' # Banner-like program prints strings as ASCII art
brew 'fish' # User-friendly command-line shell for UNIX-like operating systems
brew 'fortune' # Infamous electronic fortune-cookie generator
brew 'fzf' # Command-line fuzzy finder written in Go
brew 'gh' # GitHub command-line tool
brew 'ghorg' # Quickly clone an entire org's or user's repositories into one directory
brew 'git-lfs' # Git extension for versioning large files
brew 'git' # Distributed revision control system
brew 'gitui' # Blazing fast terminal-ui for git written in rust
brew 'glab' # Open-source GitLab command-line tool
brew 'gnupg' # GNU Pretty Good Privacy (PGP) package
brew 'golangci-lint' # Fast linters runner for Go
brew 'gomplate' # Command-line Golang template processor
brew 'grafana' # Gorgeous metric visualizations and dashboards for timeseries databases
brew 'hashicorp/tap/packer' # Tool for creating identical machine images for multiple platforms
brew 'hashicorp/tap/vault' # Vault: https://www.vaultproject.io
brew 'helm' # Kubernetes package manager
brew 'helmfile' # Deploy Kubernetes Helm Charts
brew 'highlight' # Convert source code to formatted text with syntax highlighting
brew 'htop' # Improved top (interactive process viewer)
brew 'httpie' # User-friendly cURL replacement (command-line HTTP client)
brew 'imagemagick' # Tools and libraries to manipulate images in many formats
brew 'ipcalc' # Calculate various network masks, etc. from a given IP address
brew 'istioctl' # Istio configuration command-line utility
brew 'jc' # Serializes the output of command-line tools to structured JSON output
brew 'jo' # JSON output from a shell
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'jump' # Helps you navigate your file system faster by learning your habits
brew 'k3d' # Little helper to run CNCF's k3s in Docker
brew 'k9s' # Kubernetes CLI to manage your clusters in style!
brew 'kreuzwerker/taps/m1-terraform-provider-helper' # CLI to support downloading and compiling Terraform providers for ARM-based Macs
brew 'krew' # Package manager for kubectl plugins
brew 'kubecolor/tap/kubecolor' # Colorize your kubectl output
brew 'kubectx' # Tool that can switch between kubectl contexts easily and create aliases
brew 'lf' # Terminal file manager
brew 'libsodium' # NaCl networking and cryptography library
brew 'lolcat' # Rainbows and unicorns in your console!
brew 'mailpit' # Web and API based SMTP testing
brew 'mariadb' # Drop-in replacement for MySQL
brew 'mas' # Mac App Store command-line interface
brew 'minikube' # Run a Kubernetes cluster locally
brew 'nmap' # Port scanning utility for large networks
brew 'opa' # Open source, general-purpose policy engine
brew 'opentofu' # Drop-in replacement for Terraform. Infrastructure as Code Tool
brew 'oven-sh/bun/bun' # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew 'pkg-config' # Manage compile and link flags for libraries
brew 'postgresql@14' # Object-relational database system
brew 'postgresql@15' # Object-relational database system
brew 'prometheus' # Service monitoring system and time series database
brew 'qmk/qmk/qmk' # Quantum Mechanical Keyboard (QMK) Firmware
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'ripgrep' # Search tool like grep and The Silver Searcher
brew 'shellcheck' # Static analysis and lint tool, for (ba)sh scripts
brew 'source-highlight' # Source-code syntax highlighter
brew 'starship' # Cross-shell prompt for astronauts
brew 'stow' # Organize software neatly under a single directory tree (e.g., /usr/local)
brew 'telnet' # User interface to the TELNET protocol
brew 'terraform-docs' # Tool to generate documentation from Terraform modules
brew 'terraformer' # CLI tool to generate terraform files from existing infrastructure
brew 'texinfo' # Official documentation format of the GNU project
brew 'tig' # Text interface for Git repositories
brew 'tldr' # Simplified and community-driven man pages
brew 'tmux' # Terminal multiplexer
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'watch' # Executes a program periodically, showing output fullscreen
brew 'wget' # Internet file retriever
brew 'yamllint' # Linter for YAML files
brew 'yarn' # JavaScript package manager
brew 'yq' # Process YAML documents from the CLI

# GUI apps
cask_args require_sha: true
cask '1password-cli' # Command-line interface for 1Password
cask 'adobe-acrobat-reader' # View, print, and comment on PDF documents
cask 'alfred' # Application launcher and productivity software
cask 'amazon-q' # AI-powered productivity tool for the command-line
cask 'arc' # Chromium based browser
cask 'bruno' # Open-source IDE for exploring and testing APIs
cask 'datadog-agent' # Monitoring and security across systems, apps, and services
cask 'dbeaver-community' # Universal database tool and SQL client
cask 'firefox' # Web browser
cask 'font-hack-nerd-font' # A typeface designed for source code
cask 'google-chrome', args: { require_sha: false } # Web browser
cask 'google-cloud-sdk', args: { require_sha: false } # Set of tools to manage resources and applications hosted on Google Cloud
cask 'google-drive', args: { require_sha: false } # Client for the Google Drive storage service
cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'libreoffice' # Office suite
cask 'rectangle' # Move and resize windows using keyboard shortcuts or snap areas
cask 'slack' # Team communication and collaboration software
cask 'vagrant' # Development environment
cask 'via' # Keyboard configurator
cask 'visual-studio-code' # Open-source code editor
cask 'yubico-yubikey-manager' # Application for configuring any YubiKey

# Mac App Store-managed apps
mas 'Bear', id: 1091189122 # Private Markdown Editor for iPhone, iPad and Mac
mas 'Save to Pocket', id: 1477385213 # Your save button for the internet
mas 'StuffIt Expander', id: 919269455 # Free tool to expand SITX, ZIP, ZIPX, SIT5, and RAR archives
mas 'Telephone', id: 406825478 # SIP softphone

# Home- and work-specific dependencies
if File.exist?('.home')
  cask '1password' # Password manager that keeps all passwords secure behind one password
  cask 'backblaze', args: { require_sha: false } # Data backup and storage service
  cask 'discord' # Voice and text chat software
  cask 'signal' # Instant messaging application focusing on security
  cask 'skype' # Video chat, voice call and instant messaging application
  cask 'telegram' # Messaging app with a focus on speed and security
  cask 'torguard' # VPN client
  cask 'whatsapp' # Desktop client for WhatsApp
  cask 'zoom' # Video communication and virtual meeting platform

  mas 'Shazam', id: 897118787 # Identify the music playing around you

elsif File.exist?('.work')
  cask 'notunes' # Simple application that will prevent iTunes or Apple Music from launching
end
