# 'brew tap'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jjuarez/tap-1"
cask_args require_sha: true

# 'brew install'
brew "ansible" # Automate deployment, configuration, and upgrading
brew "asdf" # Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "aws-iam-authenticator" # Use AWS IAM credentials to authenticate to Kubernetes
brew "awscli" # Official Amazon AWS command-line interface
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "cfssl" # CloudFlare's PKI toolkit
brew "chroma" # General purpose syntax highlighter in pure Go (only configured for zsh)
brew "coreutils" # GNU File, Shell, and Text utilities
brew "cowsay" # Configurable talking characters in ASCII art
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "direnv" # Load/unload environment variables based on $PWD
brew "exa" # Modern replacement for `ls`
brew "exercism" # Command-line tool to interact with exercism.io
brew "fd" # Simple, fast and user-friendly alternative to find
brew "figlet" # Banner-like program prints strings as ASCII art
brew "fish" # User-friendly command-line shell for UNIX-like operating systems
brew "fortune" # Infamous electronic fortune-cookie generator
brew "fzf" # Command-line fuzzy finder written in Go
brew "git" # Distributed revision control system
brew "gitui" # Blazing fast terminal-ui for git written in rust
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "golangci-lint" # Fast linters runner for Go
brew "gomplate" # Command-line Golang template processor
brew "helm" # Kubernetes package manager
brew "helmfile" # Deploy Kubernetes Helm Charts
brew "htop" # Improved top (interactive process viewer)
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "jc" # Serializes the output of command-line tools to structured JSON output
brew "jjuarez/tap-1/kubecolor" # Colorize your kubectl output (Alternate formula since brew installation is currently broken for the main repo: https://github.com/hidetatz/kubecolor/issues/90)
brew "jo" # JSON output from a shell
brew "jq" # Lightweight and flexible command-line JSON processor
brew "jump" # Helps you navigate your file system faster by learning your habits
brew "k9s" # Kubernetes CLI to manage your clusters in style!
brew "lf" # Terminal file manager
brew "libsodium" # NaCl networking and cryptography library
brew "lolcat" # Rainbows and unicorns in your console!
brew "mailhog" # Web and API based SMTP testing tool
brew "mas" # Mac App Store command-line interface
brew "minikube" # Run a Kubernetes cluster locally
brew "peco" # Simplistic interactive filtering tool
brew "postgresql" # Object-relational database system
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "starship" # Cross-shell prompt for astronauts
brew "telnet" # User interface to the TELNET protocol
brew "tig" # Text interface for Git repositories
brew "tldr" # Simplified and community-driven man pages
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "wget" # Internet file retriever
brew "yamllint" # Linter for YAML files
brew "yq" # Process YAML documents from the CLI
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions" # Additional completion definitions for zsh

# 'brew install --cask'
cask "1password" # Password manager that keeps all passwords secure behind one password
cask "adobe-acrobat-reader" # View, print, and comment on PDF documents
cask "alfred" # Application launcher and productivity software
cask "backblaze", args: { require_sha: false } # Data backup and storage service
cask "caffeine" # Utility that prevents the system from going to sleep
cask "dbeaver-community" # Universal database tool and SQL client
cask "discord" # Voice and text chat software
cask "docker" # App to build and share containerized applications and microservices
cask "dropbox", args: { require_sha: false } # Client for the Dropbox cloud storage service
cask "fig" # Fig adds IDE-style autocomplete to your existing terminal
cask "firefox" # Web browser
cask "font-hack-nerd-font" # A typeface designed for source code
cask "font-input", args: { require_sha: false } # Input is a flexible system of fonts designed specifically for code by David Jonathan Ross
cask "google-chrome", args: { require_sha: false } # Web browser
cask "google-drive", args: { require_sha: false } # Client for the Google Drive storage service
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "libreoffice" # Office suite
cask "postman" # Collaboration platform for API development
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "signal" # Instant messaging application focusing on security
cask "skype" # Video chat, voice call and instant messaging application
cask "slack" # Team communication and collaboration software
cask "torguard" # VPN client
cask "visual-studio-code" # Open-source code editor
cask "vlc" # Multimedia player
cask "whatsapp" # Desktop client for WhatsApp
cask "zoom" # Video communication and virtual meeting platform

# 'mas install'
mas "Bear", id: 1091189122 # Private Markdown Editor for iPhone, iPad and Mac
mas "Save to Pocket", id: 1477385213 # Your save button for the internet
mas "Shazam", id: 897118787 # Identify the music playing around you
mas "StuffIt Expander", id: 919269455 # Free tool to expand SITX, ZIP, ZIPX, SIT5, and RAR archives
mas "Telephone", id: 406825478 # SIP softphone
